[{"start_year":-10000,"end_year":-9000,"description":"Agriculture in the Fertile Crescent"},{"start_year":-10000,"end_year":-9000,"description":"Domestication of sheep in Southwest Asia (followed shortly by pigs, goats and cattle)"},{"start_year":-9500,"end_year":-9000,"description":"Oldest known surviving building – Göbekli Tepe, in Turkey"},{"start_year":-9000,"end_year":-6000,"description":"Domestication of rice in China"},{"start_year":-9000,"end_year":null,"description":"Mudbricks (unfired bricks), and clay mortar in Jericho."},{"start_year":-8400,"end_year":null,"description":"Oldest known water well in Cyprus."},{"start_year":-8040,"end_year":-7510,"description":"The Pesse canoe is the oldest boat we have found, while early human habitation of Crete and Australia make clear human seafaring goes back tens or hundreds of thousands of years. (see above)"},{"start_year":-8000,"end_year":-7500,"description":"Proto-city – large permanent settlements, such as Tell es-Sultan (Jericho) and Çatalhöyük, Turkey."},{"start_year":-8000,"end_year":-5000,"description":"Domestication of potatoes, in southern Peru and northwestern Bolivia by pre-Columbian farmers, around Lake Titicaca."},{"start_year":-7500,"end_year":-6500,"description":"Copper tools, by the people of the Old Copper Complex from the Great Lakes region of North America."},{"start_year":-7000,"end_year":null,"description":"Alcohol fermentation – specifically mead, in China"},{"start_year":-7000,"end_year":null,"description":"Sled dog and Dog sled, in Siberia."},{"start_year":-6500,"end_year":null,"description":"Evidence of lead smelting in Çatalhöyük, Turkey"},{"start_year":-6000,"end_year":null,"description":"Kiln in Mesopotamia (Iraq)"},{"start_year":-6000,"end_year":-3200,"description":"Proto-writing in present-day Egypt, Iraq, Romania, China, India and Pakistan."},{"start_year":-5900,"end_year":-5600,"description":"Oldest evidence of salt production found in Southeastern Europe, in the countries of Moldova and Romania."},{"start_year":-5500,"end_year":-5200,"description":"Oldest evidence of cheese found, in Poland and on the Dalmatian coast of Croatia."},{"start_year":-5500,"end_year":null,"description":"Sailing - pottery depictions of sail boats, in Mesopotamia,"},{"start_year":-5000,"end_year":null,"description":"Copper smelting in Serbia."},{"start_year":-5000,"end_year":null,"description":"Seawall in Tel Hreiz, near Haifa, Israel."},{"start_year":-5000,"end_year":null,"description":"Cotton thread, in Mehrgarh, Pakistan, connecting the copper beads of a bracelet."},{"start_year":-5000,"end_year":-4500,"description":"Rowing oars in China"},{"start_year":-4500,"end_year":-3500,"description":"Lost-wax casting in Palestine"},{"start_year":-4400,"end_year":null,"description":"Fired bricks in China."},{"start_year":-4000,"end_year":null,"description":"Probable time period of the first diamond-mines in the world, in Southern India."},{"start_year":-4000,"end_year":null,"description":"Paved roads, in and around the Mesopotamian city of Ur, Iraq."},{"start_year":-4000,"end_year":null,"description":"Plumbing. The earliest pipes were made of clay, and are found at the Temple of Bel at Nippur in Babylonia."},{"start_year":-4000,"end_year":null,"description":"Oldest evidence of locks, the earliest example discovered in the ruins of Nineveh, the capital of ancient Assyria."},{"start_year":-4000,"end_year":-3400,"description":"Oldest evidence of wheels, found in the countries of Ukraine, Poland, and Germany."},{"start_year":-3630,"end_year":null,"description":"Silk garments (sericulture) in China"},{"start_year":-3500,"end_year":null,"description":"Probable first domestication of the horse in the Eurasian Steppes."},{"start_year":-3500,"end_year":null,"description":"Wine as general anaesthesia in Sumer."},{"start_year":-3500,"end_year":null,"description":"Seal (emblem) invented around in the Near East, at the contemporary sites of Uruk in southern Mesopotamia and slightly later at Susa in south-western Iran during the Proto-Elamite period, and they follow the development of stamp seals in the Halaf culture or slightly earlier."},{"start_year":-3500,"end_year":null,"description":"Ploughing, on a site in Bubeneč, Czech Republic."},{"start_year":-3400,"end_year":-3100,"description":"Tattoos in southern Europe"},{"start_year":-3300,"end_year":null,"description":"The first documented swords. They have been found in Arslantepe, Turkey, are made from arsenical bronze, and are about 60 cm (24 in) long."},{"start_year":-3300,"end_year":null,"description":"City in Uruk, Sumer, Mesopotamia (modern-day Iraq)."},{"start_year":-3200,"end_year":null,"description":"Dry Latrines in the city of Uruk, Iraq, with later dry squat Toilets, that added raised fired brick foot platforms, and pedestal toilets, all over clay pipe constructed drains."},{"start_year":-3200,"end_year":null,"description":"Earliest actual wheel ever found, the Ljubljana Marshes Wheel, made of wood, in Slovenia."},{"start_year":-3000,"end_year":null,"description":"Devices functionally equivalent to dice, in the form of flat two-sided throwsticks, are seen in the Egyptian game of Senet."},{"start_year":-3000,"end_year":null,"description":"Tin extraction in Central Asia"},{"start_year":-3000,"end_year":-2560,"description":"Papyrus in Egypt"},{"start_year":-3000,"end_year":null,"description":"Reservoir in Girnar, Indus Valley."},{"start_year":-3000,"end_year":null,"description":"Receipt in Ancient Mesopotamia (Iraq)"},{"start_year":-3000,"end_year":-2800,"description":"Prosthesis first documented in the Ancient Near East, in ancient Egypt and Iran, specifically for an eye prosthetics, the eye found in Iran was likely made of bitumen paste that was covered with a thin layer of gold."},{"start_year":-3000,"end_year":-2500,"description":"Rhinoplasty in Egypt."},{"start_year":-2650,"end_year":null,"description":"The Ruler, or Measuring rod, in the subdivided Nippur, copper rod, of the Sumerian Civilisation (modern-day Iraq)."},{"start_year":-2600,"end_year":null,"description":"Planned city in Indus Valley."},{"start_year":-2600,"end_year":null,"description":"Public sewage and sanitation systems in Indus Valley sites such as Mohenjo-daro and Rakhigarhi."},{"start_year":-2600,"end_year":null,"description":"Public bath in Mohenjo-daro, Indus Valley (modern-day Pakistan)."},{"start_year":-2600,"end_year":null,"description":"Levee in Indus Valley."},{"start_year":-2600,"end_year":null,"description":"Balance weights and scales, from the Fourth Dynasty of Egypt; examples of Deben (unit) balance weights, from reign of Sneferu (c. 2600 BC) have been attributed."},{"start_year":-2556,"end_year":null,"description":"Docks structure in Wadi al-Jarf, Egypt, which was developed by the reign of the Pharaoh Khufu."},{"start_year":-2500,"end_year":null,"description":"Puppetry in the Indus Valley."},{"start_year":-2400,"end_year":null,"description":"Fork in Bronze Age Qijia culture in China"},{"start_year":-2400,"end_year":null,"description":"Copper pipes, the Pyramid of Sahure, an adjoining temple complex at Abusir, was discovered to have a network of copper drainage pipes."},{"start_year":-2400,"end_year":null,"description":"Touchstone in the Indus Valley site of Banawali (modern-day India)."},{"start_year":-2300,"end_year":null,"description":"Dictionary in Mesopotamia."},{"start_year":-2200,"end_year":-2000,"description":"Iron smelting in Kaman-Kalehöyük."},{"start_year":-2200,"end_year":null,"description":"Protractor, Phase IV, Lothal, Indus Valley (modern-day India), a Xancus shell cylinder with sawn grooves, at right angles, in its top and bottom surfaces, has been proposed as an angle marking tool."},{"start_year":-2000,"end_year":null,"description":"Water clock by at least the old Babylonian period (c. 2000 – c. 1600 BC),"},{"start_year":-2000,"end_year":null,"description":"Chariot in Russia and Kazakhstan"},{"start_year":-2000,"end_year":null,"description":"Scissors, in Mesopotamia."},{"start_year":-1850,"end_year":null,"description":"Proto-alphabet (Proto-Sinaitic script) in Egypt."},{"start_year":-1600,"end_year":null,"description":"Surgical treatise appeared in Egypt."},{"start_year":-1500,"end_year":null,"description":"Sundial in Ancient Egypt or Babylonia (modern-day Iraq)."},{"start_year":-1500,"end_year":null,"description":"Glass manufacture in either Mesopotamia or Ancient Egypt."},{"start_year":-1500,"end_year":null,"description":"Seed drill in Babylonia."},{"start_year":-1400,"end_year":null,"description":"Rubber,"},{"start_year":-1400,"end_year":-1200,"description":"Concrete in Tiryns (Mycenaean Greece),"},{"start_year":-1300,"end_year":null,"description":"Lathe in Ancient Egypt."},{"start_year":-1200,"end_year":null,"description":"Distillation is described on Akkadian tablets documenting perfumery operations."},{"start_year":-1100,"end_year":null,"description":"Star catalogue — Three Stars Each is the earliest known catalogue in long-running tradition of Babylonian astronomy,"},{"start_year":-700,"end_year":null,"description":"Saddle (fringed cloths or pads used by Assyrian cavalry)."},{"start_year":-700,"end_year":null,"description":"The royal Library of Ashurbanipal at Nineveh had 30,000 clay tablets, in several languages, organized according to shape and separated by content. The first recorded example of a library catalog."},{"start_year":-688,"end_year":null,"description":"Waterproof concrete in use, by the Assyrians."},{"start_year":-650,"end_year":null,"description":"Crossbow in China."},{"start_year":-600,"end_year":null,"description":"Coins in Phoenicia (Modern Lebanon) or Lydia."},{"start_year":-700,"end_year":null,"description":"Wagonway called Diolkos across the Isthmus of Corinth in Ancient Greece."},{"start_year":-600,"end_year":900,"description":"High Carbon Steel, produced by the Closed Crucible method, later known as Wootz steel, of South India."},{"start_year":500,"end_year":-200,"description":"Systematization of medicine and surgery in the Sushruta Samhita in Vedic Northern India. Documented procedures to:\nPerform cataract surgery (couching). Babylonian and Egyptian texts, a millennium before, depict and mention oculists, but not the procedure itself.\nPerform Caesarean section.\nConstruct Prosthetic limbs.\nPerform Plastic surgery, though reconstructive nasal surgery is described in millennia older Egyptian papyri."},{"start_year":-600,"end_year":null,"description":"Crank motion (rotary quern) in Carthage Later during the Roman empire, a mechanism appeared that incorporated a connecting rod."},{"start_year":-500,"end_year":null,"description":"Loan deeds in Upanishadic India."},{"start_year":-500,"end_year":null,"description":"Lighthouse in Greece."},{"start_year":-500,"end_year":-200,"description":"Toe stirrup, depicted in 2nd century Buddhist art, of the Sanchi and Bhaja Caves, of the Deccan Satavahana empire (modern-day India)"},{"start_year":-485,"end_year":null,"description":"Catapult by Ajatashatru in Magadha, India."},{"start_year":-485,"end_year":null,"description":"Scythed chariot by Ajatashatru in Magadha, India."},{"start_year":-500,"end_year":null,"description":"Cast iron in Ancient China: Confirmed by archaeological evidence, the earliest cast iron is developed in China by the early 5th century BC during the Zhou dynasty (1122–256 BC), the oldest specimens found in a tomb of Luhe County in Jiangsu province."},{"start_year":-480,"end_year":null,"description":"Spiral stairs (Temple A) in Selinunte, Sicily (see also List of ancient spiral stairs)"},{"start_year":-400,"end_year":null,"description":"Traction trebuchet in Ancient China."},{"start_year":-400,"end_year":null,"description":"Gears in Ancient China"},{"start_year":-400,"end_year":null,"description":"Reed pens, utilising a split nib, were used to write with ink on Papyrus in Egypt."},{"start_year":-400,"end_year":null,"description":"Nailed Horseshoe, with 4 bronze shoes found in an Etruscan tomb."},{"start_year":-375,"end_year":-350,"description":"Animal-driven rotary mill in Carthage."},{"start_year":-400,"end_year":null,"description":"Corporations in either the Maurya Empire of India or in Ancient Rome (Collegium)."},{"start_year":-400,"end_year":null,"description":"Cheque in the Maurya Empire of India."},{"start_year":-400,"end_year":null,"description":"Formal systems by Pāṇini in India, possibly during the reign of Chandragupta Maurya."},{"start_year":-400,"end_year":null,"description":"Zinc production in North-Western India during the Maurya Empire."},{"start_year":-300,"end_year":null,"description":"Analog computers in the Hellenistic world (see e.g. the Antikythera mechanism), possibly in Rhodes."},{"start_year":-300,"end_year":null,"description":"Archimedes' screw, one of the earliest hydraulic machines, was first used in the Nile river for irrigation purposes in Ancient Egypt"},{"start_year":-300,"end_year":null,"description":"Canal lock in Canal of the Pharaohs under Ptolemy II (283–246 BC) in Hellenistic Egypt"},{"start_year":-300,"end_year":null,"description":"Cam during the Hellenistic period, used in water-driven automata."},{"start_year":-300,"end_year":null,"description":"Water wheel. The origin is unclear: Indian Pali texts dating to the 4th century BCE refer to the cakkavattaka, which later commentaries describe as arahatta-ghati-yanta (machine with wheel-pots attached). Helaine Selin suggests that the device existed in Persia before 350 BC."},{"start_year":-300,"end_year":null,"description":"Gimbal described by Philo of Byzantium"},{"start_year":-300,"end_year":null,"description":"Dry dock under Ptolemy IV (221–205 BC) in Hellenistic Egypt"},{"start_year":-300,"end_year":-200,"description":"Blast furnace in Ancient China: The earliest discovered blast furnaces in China date to the 3rd and 2nd centuries BC, although most sites are from the later Han dynasty."},{"start_year":-200,"end_year":null,"description":"Paper in Han dynasty China"},{"start_year":-206,"end_year":null,"description":"Compass in Han dynasty China"},{"start_year":-200,"end_year":null,"description":"Astrolabe invented by Apollonius of Perga"},{"start_year":-100,"end_year":null,"description":"Segmental arch bridge (e.g. Pont-Saint-Martin or Ponte San Lorenzo) in Italy, Roman Republic"},{"start_year":-100,"end_year":null,"description":"News bulletin during the reign of Julius Caesar."},{"start_year":-100,"end_year":null,"description":"Arch dam (Glanum Dam) in Gallia Narbonensis, Roman Republic (see also List of Roman dams)"},{"start_year":-37,"end_year":-14,"description":"Glass blowing developed in Jerusalem."},{"start_year":-25,"end_year":null,"description":"Noodle in Lajia in China"},{"start_year":0,"end_year":null,"description":"The aeolipile, a simple steam turbine is recorded by Hero of Alexandria."},{"start_year":0,"end_year":null,"description":"The first use of respiratory protective equipment is documented by Pliny the Elder (c. 23 AD–79) using animal bladder skins to protect workers in Roman mines from red lead oxide dust."},{"start_year":0,"end_year":null,"description":"Oldest surviving wine."},{"start_year":0,"end_year":null,"description":"Vending machines invented by Hero of Alexandria"},{"start_year":132,"end_year":132,"description":"Seismometer and pendulum in Han dynasty China, built by Zhang Heng. It is a large metal urn-shaped instrument which employed either a suspended pendulum or inverted pendulum acting on inertia, like the ground tremors from earthquakes, to dislodge a metal ball by a lever trip device."},{"start_year":100,"end_year":null,"description":"Carding in India."},{"start_year":200,"end_year":null,"description":"Crystallized sugar in India."},{"start_year":200,"end_year":null,"description":"Woodblock printing is invented in Han dynasty China at sometime before 220 AD. This made China become the world's first print culture."},{"start_year":200,"end_year":300,"description":"Water turbine in the Roman Empire in modern-day Tunisia."},{"start_year":300,"end_year":null,"description":"Roman Dichroic glass, which displays one of two different colors depending on lighting conditions."},{"start_year":300,"end_year":null,"description":"Simple suspension bridge, independently invented in Pre-Columbian South America,  and the Hindu Kush range, of present-day Afghanistan and Pakistan. With Han dynasty travelers noting bridges being constructed from 3 or more vines or 3 ropes."},{"start_year":300,"end_year":null,"description":"Fishing reel in Ancient China: In literary records, the earliest evidence of the fishing reel comes from a 4th-century AD"},{"start_year":347,"end_year":347,"description":"Oil Wells and Borehole drilling in China. Such wells could reach depths of up to 240 m (790 ft)."},{"start_year":400,"end_year":400,"description":"The construction of the Iron pillar of Delhi in Mathura by the Gupta Empire shows the development of rust-resistant ferrous metallurgy in Ancient India, although original texts do not survive to detail the specific processes invented in this period."},{"start_year":400,"end_year":null,"description":"The horse collar as a fully developed collar harness is developed in Northern and Southern dynasties China during the 5th century AD."},{"start_year":400,"end_year":500,"description":"Pointed arch bridge (Karamagara Bridge) in Cappadocia, Eastern Roman Empire"},{"start_year":500,"end_year":null,"description":"Incense clock in China."},{"start_year":563,"end_year":563,"description":"Pendentive dome (Hagia Sophia) in Constantinople, Eastern Roman Empire"},{"start_year":577,"end_year":577,"description":"Sulfur matches exist in China"},{"start_year":589,"end_year":589,"description":"Toilet paper in Sui dynasty China, first mentioned by the official Yan Zhitui (531–591), with full evidence of continual use in subsequent dynasties."},{"start_year":619,"end_year":619,"description":"Toothbrush in China during the Tang dynasty"},{"start_year":672,"end_year":672,"description":"Greek fire in Constantinople, Byzantine Empire: Greek fire, an incendiary weapon likely based on petroleum or naphtha, is invented by Kallinikos, a Lebanese Greek refugee from Baalbek, as described by Theophanes."},{"start_year":600,"end_year":null,"description":"Banknote in Tang dynasty China: The banknote is first developed in China during the Tang and Song dynasties, starting in the 7th century. Its roots are in merchant receipts of deposit during the Tang dynasty (618–907), as merchants and wholesalers desire to avoid the heavy bulk of copper coinage in large commercial transactions."},{"start_year":600,"end_year":null,"description":"Porcelain in Tang dynasty China: True porcelain is manufactured in northern China from roughly the beginning of the Tang dynasty in the 7th century, while true porcelain was not manufactured in southern China until about 300 years later, during the early 10th century."},{"start_year":800,"end_year":null,"description":"Gunpowder in Tang dynasty China: Gunpowder is, according to prevailing academic consensus, discovered in the 9th century by Chinese alchemists searching for an elixir of immortality."},{"start_year":800,"end_year":null,"description":"Playing card in Tang dynasty China"},{"start_year":900,"end_year":null,"description":"Fire lance in Song dynasty China, developed in the 10th century with a tube of first bamboo and later on metal that shot a weak gunpowder blast of flame and shrapnel, its earliest depiction is a painting found at Dunhuang."},{"start_year":900,"end_year":null,"description":"Fireworks in Song dynasty China: Fireworks first appear in China during the Song dynasty (960–1279), in the early age of gunpowder. Fireworks could be purchased from market vendors; these were made of sticks of bamboo packed with gunpowder."},{"start_year":974,"end_year":974,"description":"Fountain pen: invented at the request of al-Mu'izz li-Din Allah in Arab Egypt."},{"start_year":1000,"end_year":null,"description":"Early versions of the Bessemer process are developed in China."},{"start_year":1000,"end_year":null,"description":"Endless power-transmitting chain drive by Su Song for the development an astronomical clock (the Cosmic Engine)"},{"start_year":1000,"end_year":null,"description":"Calico was developed in Calicut, India."},{"start_year":1088,"end_year":1088,"description":"Movable type in Song dynasty China: The first record of a movable type system is in the Dream Pool Essays, which attributes the invention of the movable type to Bi Sheng."},{"start_year":1200,"end_year":null,"description":"Rocket for military and recreational uses date back to at least 13th-century China."},{"start_year":1200,"end_year":null,"description":"The earliest form of mechanical escapement, the verge escapement in Europe."},{"start_year":1200,"end_year":null,"description":"Buttons (combined with buttonholes) as a functional fastening for closing clothes appear first in Germany."},{"start_year":1200,"end_year":null,"description":"Explosive bomb in Jin dynasty Manchuria: Explosive bombs are used in 1221 by the Jin dynasty against a Song dynasty city."},{"start_year":1200,"end_year":null,"description":"Hand cannon in Yuan dynasty China: The earliest hand cannon dates to the 13th century based on archaeological evidence from a Heilongjiang excavation. There is also written evidence in the Yuanshi (1370) on Li Tang, an ethnic Jurchen commander under the Yuan dynasty who in 1288 suppresses the rebellion of the Christian prince Nayan with his \"gun-soldiers\" or chongzu, this being the earliest known event where this phrase is used."},{"start_year":1200,"end_year":null,"description":"Earliest documented snow goggles, a type of sunglasses, made of flattened walrus or caribou ivory are used by the Inuit peoples in the arctic regions of North America."},{"start_year":1200,"end_year":null,"description":"Double-entry bookkeeping in Italy."},{"start_year":1200,"end_year":1300,"description":"Worm gear cotton gin in India."},{"start_year":1277,"end_year":1277,"description":"Land mine in Song dynasty China: Textual evidence suggests that the first use of a land mine in history is by a Song dynasty brigadier general known as Lou Qianxia, who uses an 'enormous bomb' (huo pao) to kill Mongol soldiers invading Guangxi in 1277."},{"start_year":1286,"end_year":1286,"description":"Eyeglasses in Italy"},{"start_year":1300,"end_year":1300,"description":"Huolongchushui, the first Multistage rocket, was developed in Ming dynasty China and described in Huolongjing by Jiao Yu."},{"start_year":1300,"end_year":null,"description":"Painting Canvas was first used in Italy."},{"start_year":1300,"end_year":null,"description":"Jacob's staff described by Levi ben Gerson"},{"start_year":1300,"end_year":null,"description":"Naval mine in Ming dynasty Mentioned in the Huolongjing military manuscript written by Jiao Yu (fl. 14th to early 15th century) and Liu Bowen (1311–1375), describing naval mines used at sea or on rivers and lakes, made of wrought iron and enclosed in an ox bladder. A later model is documented in Song Yingxing's encyclopedia written in 1637."},{"start_year":1300,"end_year":null,"description":"Bidriware in the Bahmani Sultanate in India."},{"start_year":1364,"end_year":1364,"description":"first use of a handgun"},{"start_year":1400,"end_year":null,"description":"Coil spring in Europe"},{"start_year":1400,"end_year":null,"description":"Mainspring in Europe"},{"start_year":1439,"end_year":1439,"description":"Printing press in Mainz, Germany: The printing press is invented in the Holy Roman Empire by Johannes Gutenberg before 1440, based on existing screw presses."},{"start_year":1400,"end_year":null,"description":"The Arquebus (also spelled Harquebus) is invented, possibly in Spain."},{"start_year":1500,"end_year":null,"description":"Chintz or printed clothing in Golconda, India"},{"start_year":1500,"end_year":null,"description":"Hookah by Irfan Shaikh, at the court of the Mughal emperor Akbar I"},{"start_year":1540,"end_year":1540,"description":"Rifling is first used in firearms, after being invented in 1498"},{"start_year":1560,"end_year":1560,"description":"Floating dry dock in Venice, Venetian Republic"},{"start_year":1569,"end_year":1569,"description":"Mercator Projection map created by Gerardus Mercator"},{"start_year":1589,"end_year":1589,"description":"Stocking frame: Invented by William Lee."},{"start_year":1594,"end_year":1594,"description":"Backstaff: Invented by Captain John Davis"},{"start_year":1605,"end_year":1605,"description":"Newspaper (Relation): Johann Carolus in Strassburg (see also List of the oldest newspapers)"},{"start_year":1608,"end_year":1608,"description":"Telescope: Patent applied for by Hans Lippershey. Actual inventor unknown since it seemed to already be a common item being offered by the spectacle makers in the Netherlands with Jacob Metius also applying for patent and the son of Zacharias Janssen making a claim 47 years later that his father invented it."},{"start_year":1620,"end_year":1620,"description":"Compound microscopes, which combine an objective lens with an eyepiece to view a real image, first appear in Europe. Apparently derived from the telescope, actual inventor unknown, variously attributed to Zacharias Janssen (his son claiming it was invented in 1590), Cornelis Drebbel, and Galileo Galilei."},{"start_year":1630,"end_year":1630,"description":"Slide rule: invented by William Oughtred"},{"start_year":1630,"end_year":1630,"description":"first use of the flintlock"},{"start_year":1642,"end_year":1642,"description":"Mechanical calculator. The Pascaline is built by Blaise Pascal."},{"start_year":1643,"end_year":1643,"description":"Barometer: invented by Evangelista Torricelli, or possibly up to three years earlier by Gasparo Berti."},{"start_year":1650,"end_year":1650,"description":"Vacuum pump: Invented by Otto von Guericke."},{"start_year":1656,"end_year":1656,"description":"Pendulum clock: Invented by Christiaan Huygens. It was first conceptualized in 1637 by Galileo Galilei but he was unable to create a working model."},{"start_year":1668,"end_year":1668,"description":"First functional reflecting telescope constructed by Isaac Newton."},{"start_year":1679,"end_year":1679,"description":"Pressure-cooker: Invented by Denis Papin."},{"start_year":1680,"end_year":1680,"description":"Christiaan Huygens provides the first known description of a piston engine."},{"start_year":1698,"end_year":1698,"description":"Thomas Savery develops a steam-powered water pump: for draining mines"},{"start_year":1709,"end_year":1709,"description":"Bartolomeo Cristofori crafts the first piano, which became a leading instrument of Western art music"},{"start_year":1712,"end_year":1712,"description":"Thomas Newcomen builds the first commercial steam engine to pump water out of mines."},{"start_year":1738,"end_year":1738,"description":"Lewis Paul and John Wyatt invent the first mechanized cotton spinning machine, helping to establish the British textile industry"},{"start_year":1745,"end_year":1745,"description":"Musschenbroek and Kleist independently develop the Leyden jar, an early form of capacitor."},{"start_year":1746,"end_year":1746,"description":"John Roebuck invents the lead chamber process, mass producing sulfuric acid for manufacturing"},{"start_year":1755,"end_year":1755,"description":"William Cullen invents the first artificial refrigeration machine"},{"start_year":1764,"end_year":1764,"description":"James Hargreaves invents the spinning jenny, revolutionizing textile production during the Industrial Revolution"},{"start_year":1769,"end_year":1769,"description":"Nicolas-Joseph Cugnot invents the first steam-powered vehicle capable of carrying passengers, an early car"},{"start_year":1774,"end_year":1774,"description":"John Wilkinson invents his boring machine, considered by some to be the first machine tool"},{"start_year":1775,"end_year":1775,"description":"Jesse Ramsden invents the modern screw-cutting lathe"},{"start_year":1776,"end_year":1776,"description":"John Wilkinson invents a mechanical air compressor that would become the prototype for all later mechanical compressors"},{"start_year":1780,"end_year":1780,"description":"Hyder Ali of Mysore, India develops the first metal-cylinder rockets."},{"start_year":1783,"end_year":1783,"description":"Claude de Jouffroy builds the first steamboat"},{"start_year":1783,"end_year":1783,"description":"Joseph-Ralf and Jacques-Étienne Montgolfier build the first manned hot air balloon"},{"start_year":1783,"end_year":1783,"description":"Louis-Sébastien Lenormand invents and uses the first modern parachute"},{"start_year":1785,"end_year":1785,"description":"Martinus van Marum is the first to use the electrolysis technique"},{"start_year":1786,"end_year":1786,"description":"Andrew Meikle invents the threshing machine"},{"start_year":1789,"end_year":1789,"description":"Edmund Cartwright invents the power loom"},{"start_year":1792,"end_year":1792,"description":"Claude Chappe invents the semaphore telegraph"},{"start_year":1793,"end_year":1793,"description":"Eli Whitney invents the modern cotton gin"},{"start_year":1795,"end_year":1795,"description":"Joseph Bramah invents the hydraulic press"},{"start_year":1796,"end_year":1796,"description":"Alois Senefelder invents the lithography printing technique."},{"start_year":1796,"end_year":1796,"description":": Edward Jenner invented the vaccine and inoculates an individual for smallpox"},{"start_year":1799,"end_year":1799,"description":"The first paper machine is invented by Louis-Nicolas Robert"},{"start_year":1800,"end_year":1800,"description":"Alessandro Volta invents the voltaic pile, an early form of battery in Italy, based on previous works by Luigi Galvani."},{"start_year":1802,"end_year":1802,"description":"Humphry Davy invents the arc lamp (exact date unclear; not practical as a light source until the invention of efficient electric generators)."},{"start_year":1804,"end_year":1804,"description":"Friedrich Sertürner discovers morphine as the first active alkaloid extracted from the opium poppy plant."},{"start_year":1804,"end_year":1804,"description":"Joseph Marie Jacquard develops his automated Jacquard loom."},{"start_year":1804,"end_year":1804,"description":"Richard Trevithick invents the steam locomotive."},{"start_year":1804,"end_year":1804,"description":"Hanaoka Seishū creates tsūsensan, the first modern general anesthetic."},{"start_year":1807,"end_year":1807,"description":"Nicéphore Niépce invents  an early internal combustion engine capable of doing useful work."},{"start_year":1807,"end_year":1807,"description":"François Isaac de Rivaz designs the first automobile powered by an internal combustion engine fuelled by hydrogen."},{"start_year":1807,"end_year":1807,"description":"Robert Fulton expands water transportation and trade with the workable steamboat."},{"start_year":1810,"end_year":1810,"description":"Nicolas Appert invents the canning process for food."},{"start_year":1810,"end_year":1810,"description":"Abraham-Louis Breguet creates the first wristwatch."},{"start_year":1811,"end_year":1811,"description":"Friedrich Koenig invents the first powered printing press, which was also the first to use a cylinder."},{"start_year":1812,"end_year":1812,"description":"William Reid Clanny pioneered the invention of the safety lamp which he improved in later years. Safety lamps based on Clanny's improved design were used until the adoption of electric lamps."},{"start_year":1814,"end_year":1814,"description":"James Fox invents the modern planing machine, though Matthew Murray of Leeds and Richard Roberts of Manchester have also been credited at times with its invention."},{"start_year":1816,"end_year":1816,"description":"René Laennec  invents the first Stethoscope."},{"start_year":1816,"end_year":1816,"description":"Francis Ronalds builds the first working electric telegraph using electrostatic means."},{"start_year":1816,"end_year":1816,"description":"Robert Stirling invents the Stirling engine."},{"start_year":1817,"end_year":1817,"description":"Baron Karl von Drais invents the dandy horse, an early velocipede and precursor to the modern bicycle."},{"start_year":1818,"end_year":1818,"description":"Marc Isambard Brunel invents the tunnelling shield."},{"start_year":1822,"end_year":1822,"description":"Thomas Blanchard invents the pattern-tracing lathe (actually more like a shaper). The lathe can copy symmetrical shapes and is used for making gun stocks, and later, ax handles."},{"start_year":1822,"end_year":1822,"description":"Nicéphore Niépce invents Heliography, the first photographic process."},{"start_year":1822,"end_year":1822,"description":"Charles Babbage, considered the \"father of the computer\", begins building the first programmable mechanical computer."},{"start_year":1823,"end_year":1823,"description":"Johann Wolfgang Döbereiner invents the first lighter."},{"start_year":1824,"end_year":1824,"description":"Johann Nikolaus von Dreyse invents the bolt-action rifle."},{"start_year":1824,"end_year":1824,"description":"William Sturgeon invents the electromagnet."},{"start_year":1826,"end_year":1826,"description":"John Walker invents the friction match."},{"start_year":1826,"end_year":1826,"description":"James Sharp invents and goes on to manufacture the first practical gas stove."},{"start_year":1828,"end_year":1828,"description":"James Beaumont Neilson develops the hot blast process."},{"start_year":1828,"end_year":1828,"description":"Patrick Bell invents the reaping machine."},{"start_year":1828,"end_year":1828,"description":"Hungarian physicist Ányos Jedlik invents the first commutated rotary electromechanical machine with electromagnets."},{"start_year":1829,"end_year":1829,"description":"Louis Braille invents the Braille reading system for the blind."},{"start_year":1829,"end_year":1829,"description":"William Mann invents the compound air compressor."},{"start_year":1829,"end_year":1829,"description":"Henry Robinson Palmer is awarded a patent for corrugated galvanised iron."},{"start_year":1830,"end_year":1830,"description":"Edwin Budding invents the lawn mower."},{"start_year":1831,"end_year":1831,"description":"Michael Faraday invents a method of electromagnetic induction. It would be independently invented by Joseph Henry the following year. Faraday is credited with inventing the first electric generator called the Faraday disk."},{"start_year":1833,"end_year":1833,"description":": Charles Babbage introduces his \"mechanical calculating machine\", the first mechanical computer"},{"start_year":1834,"end_year":1834,"description":"Moritz von Jacobi invents the first practical electric motor."},{"start_year":1835,"end_year":1835,"description":"Joseph Henry invents the electromechanical relay."},{"start_year":1837,"end_year":1837,"description":"Samuel Morse invents Morse code."},{"start_year":1838,"end_year":1838,"description":"Moritz von Jacobi invents electrotyping."},{"start_year":1839,"end_year":1839,"description":"William Otis invents the steam shovel."},{"start_year":1839,"end_year":1839,"description":"James Nasmyth invents the steam hammer."},{"start_year":1839,"end_year":1839,"description":"Edmond Becquerel invents a method for the photovoltaic effect, effectively producing the first solar cell."},{"start_year":1839,"end_year":1839,"description":"Charles Goodyear invents vulcanized rubber."},{"start_year":1839,"end_year":1839,"description":"Louis Daguerre invents daguerreotype photography."},{"start_year":1839,"end_year":1839,"description":"Kirkpatrick Macmillan invents the first bicycle"},{"start_year":1840,"end_year":1840,"description":"John Herschel invents the blueprint."},{"start_year":1841,"end_year":1841,"description":"Alexander Bain devises a printing telegraph."},{"start_year":1842,"end_year":1842,"description":"William Robert Grove invents the first fuel cell."},{"start_year":1842,"end_year":1842,"description":"John Bennet Lawes invents superphosphate, the first man-made fertilizer."},{"start_year":1844,"end_year":1844,"description":"Friedrich Gottlob Keller and, independently, Charles Fenerty come up with the wood pulp method of paper production."},{"start_year":1844,"end_year":1844,"description":"Francis Rynd invents the hypodermic needle."},{"start_year":1844,"end_year":1844,"description":"Horace Wells successfully used nitrous oxide as an anesthesia"},{"start_year":1845,"end_year":1845,"description":"Isaac Charles Johnson invents modern Portland cement."},{"start_year":1846,"end_year":1846,"description":"Henri-Joseph Maus invents the tunnel boring machine."},{"start_year":1846,"end_year":1846,"description":"Elias Howe received a patent for a sewing machine, the model for the Singer Sewing Machine"},{"start_year":1847,"end_year":1847,"description":"Ascanio Sobrero invents nitroglycerin, the first explosive made that was stronger than black powder."},{"start_year":1848,"end_year":1848,"description":"Jonathan J. Couch invents the pneumatic drill."},{"start_year":1848,"end_year":1848,"description":"Linus Yale Sr. invents the first modern pin tumbler lock."},{"start_year":1849,"end_year":1849,"description":"Walter Hunt invents the first repeating rifle to use metallic cartridges (of his own design) and a spring-fed magazine."},{"start_year":1849,"end_year":1849,"description":"James B. Francis invents the Francis turbine."},{"start_year":1849,"end_year":1849,"description":"Walter Hunt invents the safety pin."},{"start_year":1850,"end_year":1850,"description":"William Armstrong invents the hydraulic accumulator."},{"start_year":1851,"end_year":1851,"description":"George Jennings offers the first public flush toilets, accessible for a penny per visit, and in 1852 receives a UK patent for the single piece, free standing, earthenware, trap plumed, flushing, water-closet."},{"start_year":1852,"end_year":1852,"description":"Robert Bunsen is the first to use a chemical vapor deposition technique."},{"start_year":1852,"end_year":1852,"description":"Elisha Otis invents the safety brake elevator."},{"start_year":1852,"end_year":1852,"description":"Henri Giffard becomes the first person to make a manned, controlled and powered flight using a dirigible."},{"start_year":1853,"end_year":1853,"description":"François Coignet invents reinforced concrete."},{"start_year":1855,"end_year":1855,"description":"James Clerk Maxwell invents the first practical method for color photography, whether chemical or electronic."},{"start_year":1855,"end_year":1855,"description":"Henry Bessemer patents the Bessemer process for making steel, with improvements made by others over the following years."},{"start_year":1856,"end_year":1856,"description":"Alexander Parkes invents parkesine, also known as celluloid, the first man-made plastic."},{"start_year":1856,"end_year":1856,"description":"James Harrison produces the world's first practical ice making machine and refrigerator using the principle of vapour compression in Geelong, Australia."},{"start_year":1856,"end_year":1856,"description":"William Henry Perkin invents mauveine, the first synthetic dye."},{"start_year":1857,"end_year":1857,"description":"Heinrich Geissler invents the Geissler tube."},{"start_year":1857,"end_year":1857,"description":"The phonautograph, the earliest known device for recording sound, is patented and invented by Frenchman Édouard-Léon Scott de Martinville."},{"start_year":1859,"end_year":1859,"description":"Gaston Planté invents the lead acid battery, the first rechargeable battery."},{"start_year":1860,"end_year":1860,"description":"Joseph Swan produces carbon fibers."},{"start_year":1862,"end_year":1862,"description":"Richard Jordan Gatling invents the Gatling gun, the first multi-barrel rapid-fire gun."},{"start_year":1864,"end_year":1864,"description":"Louis Pasteur invents the pasteurization process."},{"start_year":1865,"end_year":1865,"description":"Carl Wilhelm Siemens and Pierre-Émile Martin invent the Siemens-Martin process for making steel."},{"start_year":1867,"end_year":1867,"description":"Alfred Nobel invents dynamite, the first safely manageable explosive stronger than black powder."},{"start_year":1867,"end_year":1867,"description":"Lucien B. Smith invents barbed wire."},{"start_year":1872,"end_year":1872,"description":"Polyvinyl chloride, more commonly known as vinyl, is synthesized by German chemist Eugen Baumann."},{"start_year":1872,"end_year":1872,"description":"J. E. T. Woods and J. Clark invent stainless steel. Harry Brearley is the first to commercialize it."},{"start_year":1873,"end_year":1873,"description":"Frederick Ransome invents the rotary kiln."},{"start_year":1873,"end_year":1873,"description":"William Crookes, a chemist, invents the Crookes radiometer as the by-product of some chemical research."},{"start_year":1873,"end_year":1873,"description":"Zénobe Gramme invents the first commercial electrical generator, the Gramme machine."},{"start_year":1874,"end_year":1874,"description":"Gustave Trouvé invents the first metal detector."},{"start_year":1874,"end_year":1874,"description":"Ferdinand von Zeppelin invents the Zeppelin rigid airship."},{"start_year":1875,"end_year":1875,"description":"Fyodor Pirotsky invents the first electric tram near Saint Petersburg, Russia."},{"start_year":1876,"end_year":1876,"description":"Nicolaus August Otto invents the four-stroke cycle."},{"start_year":1876,"end_year":1876,"description":"Alexander Graham Bell has a patent granted for the telephone."},{"start_year":1877,"end_year":1877,"description":"Thomas Edison invents the first working phonograph."},{"start_year":1878,"end_year":1878,"description":"Henry Fleuss is granted a patent for the first practical rebreather."},{"start_year":1878,"end_year":1878,"description":"Lester Allan Pelton invents the Pelton wheel, a type of water turbine."},{"start_year":1879,"end_year":1879,"description":"Joseph Swan and Thomas Edison both patent a functional incandescent light bulb."},{"start_year":1881,"end_year":1881,"description":"Nikolay Benardos presents carbon arc welding, the first practical arc welding method."},{"start_year":1884,"end_year":1884,"description":"Hiram Maxim invents the recoil-operated Maxim gun, ushering in the age of semi- and fully automatic firearms."},{"start_year":1884,"end_year":1884,"description":"Paul Vieille invents Poudre B, the first smokeless powder for firearms."},{"start_year":1884,"end_year":1884,"description":"Sir Charles Parsons invents the modern steam turbine."},{"start_year":1884,"end_year":1884,"description":"Hungarian engineers Károly Zipernowsky, Ottó Bláthy and Miksa Déri invent the closed core high efficiency transformer and the AC parallel power distribution."},{"start_year":1885,"end_year":1885,"description":"John Kemp Starley invents the modern safety bicycle."},{"start_year":1886,"end_year":1886,"description":"Carl Gassner invents the zinc–carbon battery, the first dry cell battery, making portable electronics practical."},{"start_year":1886,"end_year":1886,"description":"Charles Martin Hall and independently Paul Héroult invent the Hall–Héroult process for economically producing aluminum in 1886."},{"start_year":1886,"end_year":1886,"description":"Karl Benz invents the first petrol or gasoline powered auto-mobile (car)."},{"start_year":1887,"end_year":1887,"description":"Carl Josef Bayer invents the Bayer process for the production of alumina."},{"start_year":1887,"end_year":1887,"description":"James Blyth invents the first wind turbine used for generating electricity."},{"start_year":1887,"end_year":1887,"description":"John Stewart MacArthur, working in collaboration with brothers Dr. Robert and Dr. William Forrest, develops the process of gold cyanidation."},{"start_year":1888,"end_year":1888,"description":"John J. Loud invents the ballpoint pen."},{"start_year":1888,"end_year":1888,"description":"Thomas Edison and William Kennedy Dickson invent the Kinetoscope."},{"start_year":1888,"end_year":1888,"description":"The first practical pneumatic tire was made by Scotsman John Boyd Dunlop, the patent was from 1847 by Robert William Thomson"},{"start_year":1890,"end_year":1890,"description":"Robert Gair invents the pre-cut cardboard box."},{"start_year":1891,"end_year":1891,"description":"Whitcomb Judson invents the zipper."},{"start_year":1892,"end_year":1892,"description":"Léon Bouly invents the cinematograph."},{"start_year":1892,"end_year":1892,"description":"Thomas Ahearn invents the electric oven."},{"start_year":1892,"end_year":1892,"description":": John Froelich invented the gas-powered tractor"},{"start_year":1893,"end_year":1893,"description":"Rudolf Diesel invents the diesel engine (although Herbert Akroyd Stuart had experimented with compression ignition before Diesel)."},{"start_year":1893,"end_year":1893,"description":"William Stewart Halsted, invents the rubber glove for his wife Caroline Hampton as he noticed her hands were affected by the daily surgeries she had performed. The gloves were intended to prevent medical staff from developing dermatitis from surgical chemicals."},{"start_year":1895,"end_year":1895,"description":"Guglielmo Marconi invents the radio, a system of wireless communication using radio waves."},{"start_year":1895,"end_year":1895,"description":"Wilhelm Conrad Röntgen invented the first radiograph (X-ray)."},{"start_year":1897,"end_year":1897,"description":"Surgical masks made of cloth were developed in Europe by physicians Jan Mikulicz-Radecki at the University of Breslau and Paul Berger in Paris, as a result of increasing awareness of germ theory and the importance of antiseptic procedures in medicine."},{"start_year":1898,"end_year":1898,"description":"Hans von Pechmann synthesizes polyethylene, now the most common plastic in the world."},{"start_year":1899,"end_year":1899,"description":"Waldemar Jungner invents the rechargeable nickel-cadmium battery (NiCd) as well as the nickel-iron electric storage battery (NiFe) and the rechargeable alkaline silver-cadmium battery (AgCd)"},{"start_year":1901,"end_year":1901,"description":"The first motorized cleaner using suction, a powered \"vacuum cleaner\", is patented independently by Hubert Cecil Booth and David T. Kenney."},{"start_year":1903,"end_year":1903,"description":"The first successful gas turbine is invented by Ægidius Elling."},{"start_year":1903,"end_year":1903,"description":"Édouard Bénédictus invents laminated glass."},{"start_year":1904,"end_year":1904,"description":"The Fleming valve, the first vacuum tube and diode, is invented by John Ambrose Fleming."},{"start_year":1907,"end_year":1907,"description":"Leo Baekeland invents bakelite,  the first plastic made from synthetic components."},{"start_year":1907,"end_year":1907,"description":"The tuyères thermopropulsives"},{"start_year":1908,"end_year":1908,"description":"Cellophane is invented by Jacques E. Brandenberger."},{"start_year":1909,"end_year":1909,"description":"Fritz Haber invents the Haber process."},{"start_year":1911,"end_year":1911,"description":"The cloud chamber, the first particle detector, is invented by Charles Thomson Rees Wilson."},{"start_year":1913,"end_year":1913,"description":"The Bergius process is developed by Friedrich Bergius."},{"start_year":1913,"end_year":1913,"description":"The Kaplan turbine is invented by Viktor Kaplan."},{"start_year":1915,"end_year":1915,"description":"Harry Brearley invents a process to create Martensitic stainless steel, initially labelled Rustless Steel, later marketed as Staybrite, and AISI Type 420."},{"start_year":1915,"end_year":1915,"description":"The first operational military tanks are designed in Great Britain and France. They are used in battle from 1916 and 1917 respectively. The designers in Great Britain are Walter Wilson and William Tritton and in France, Eugène Brillié. (Although it is known that vehicles incorporating at least some of the features of the tank were designed in a number of countries from 1903 onward, none reached a practical form.)"},{"start_year":1916,"end_year":1916,"description":"The Czochralski process, widely used for the production of single crystal silicon, is invented by Jan Czochralski."},{"start_year":1917,"end_year":1917,"description":"The crystal oscillator is invented by Alexander M. Nicolson using a crystal of Rochelle Salt although his priority was disputed by Walter Guyton Cady."},{"start_year":1925,"end_year":1925,"description":"The Fischer–Tropsch process is developed by Franz Fischer and Hans Tropsch at the Kaiser-Wilhelm-Institut für Kohlenforschung."},{"start_year":1926,"end_year":1926,"description":"The Yagi-Uda Antenna or simply Yagi Antenna is invented by Shintaro Uda of Tohoku Imperial University, assisted by his colleague Hidetsugu Yagi. The Yagi Antenna was widely used during World War II. After the war they saw extensive development as home television antennas."},{"start_year":1926,"end_year":1926,"description":"Robert H. Goddard launches the first liquid fueled rocket."},{"start_year":1926,"end_year":1926,"description":"Harry Ferguson, patents the Three-point hitch equipment linkage system for tractors."},{"start_year":1926,"end_year":1926,"description":"John Logie Baird demonstrates the world's first live working television system."},{"start_year":1927,"end_year":1927,"description":"The quartz clock is invented by Warren Marrison and J.W. Horton at Bell Telephone Laboratories."},{"start_year":1928,"end_year":1928,"description":"Penicillin is first observed to exude antibiotic substances by Nobel laureate Alexander Fleming. Development of medicinal penicillin is attributed to a team of medics and scientists including Howard Walter Florey, Ernst Chain and Norman Heatley."},{"start_year":1928,"end_year":1928,"description":"Frank Whittle formally submitted his ideas for a turbo-jet engine. In October 1929, he developed his ideas further."},{"start_year":1928,"end_year":1928,"description":"Philo Farnsworth demonstrates the first practical electronic television to the press."},{"start_year":1929,"end_year":1929,"description":"The ball screw is invented by Rudolph G. Boehm."},{"start_year":1930,"end_year":1930,"description":"The Supersonic combusting ramjet — Frank Whittle."},{"start_year":1930,"end_year":1930,"description":"The Phase-contrast microscopy is invented by Frits Zernike."},{"start_year":1931,"end_year":1931,"description":"The electron microscope is invented by Ernst Ruska."},{"start_year":1933,"end_year":1933,"description":"FM radio is patented by inventor Edwin H. Armstrong."},{"start_year":1933,"end_year":1933,"description":"Harry C. Jennings Sr. and Herbert Everest, both mechanical engineers, invented the first lightweight, steel, folding, portable wheelchair with their \"X-brace\" design."},{"start_year":1935,"end_year":1935,"description":"Nylon, the first fully synthetic fiber is produced by Wallace Carothers while working at DuPont."},{"start_year":1938,"end_year":1938,"description":"Z1, built by Konrad Zuse, is the first freely programmable computer in the world."},{"start_year":1938,"end_year":1938,"description":"Nuclear fission discovered in experiment by chemists Otto Hahn and Fritz Strassmann and physicists Lise Meitner and Otto Robert Frisch. The German nuclear energy project was based on this research. The Tube Alloys project and, subsequently, the Manhattan Project and the Soviet atomic bomb project were influenced by this research."},{"start_year":1939,"end_year":1939,"description":"G. S. Yunyev or Naum Gurvich invented the electric current defibrillator"},{"start_year":1939,"end_year":1939,"description":": John Vincent Atanasoff invented the first electronic digital computer"},{"start_year":1940,"end_year":1940,"description":"Pu-239 isotope (isotope of plutonium)"},{"start_year":1940,"end_year":1940,"description":"John Randall and Harry Boot would develop the high power, microwave generating, cavity magnetron, later applied to commercial Radar and Microwave oven appliances."},{"start_year":1941,"end_year":1941,"description":"Polyester is invented by John Rex Whinfield and James Dickson."},{"start_year":1942,"end_year":1942,"description":"The V-2 rocket, the world's first long range ballistic missile, developed by engineer Wernher von Braun."},{"start_year":1942,"end_year":1942,"description":": Enrico Fermi developed the nuclear reactor and created the first controlled nuclear chain reaction"},{"start_year":1944,"end_year":1944,"description":"The non-infectious viral vaccine is perfected by Dr. Jonas Salk and Thomas Francis."},{"start_year":1945,"end_year":1945,"description":"The atomic bomb is developed by the Manhattan Project and swiftly used in August 1945 in the atomic bombings of Hiroshima and Nagasaki."},{"start_year":1945,"end_year":1945,"description":"Percy Spencer, while employed at Raytheon, would patent a magnetron based microwave oven."},{"start_year":1945,"end_year":1945,"description":"Willard Libby began his work on radiocarbon dating. He published his paper in 1946,"},{"start_year":1946,"end_year":1946,"description":"James Martin invents the ejector seat, inspired by the death of his friend and test pilot Captain Valentine Baker in an aeroplane crash in 1942."},{"start_year":1947,"end_year":1947,"description":"Holography is invented by Dennis Gabor."},{"start_year":1947,"end_year":1947,"description":"Floyd Farris and J.B. Clark (Stanolind Oil and Gas Corporation) invents hydraulic fracturing technology."},{"start_year":1947,"end_year":1947,"description":"The first transistor, a bipolar point-contact transistor, is invented by John Bardeen and Walter Brattain under the supervision of William Shockley at Bell Labs."},{"start_year":1948,"end_year":1948,"description":"The first atomic clock is developed at the National Bureau of Standards."},{"start_year":1948,"end_year":1948,"description":"Basic oxygen steelmaking is developed by Robert Durrer. The majority of steel manufactured in the world is produced using the basic oxygen furnace; in 2000, it accounted for 60% of global steel output."},{"start_year":1950,"end_year":1950,"description":"Bertie the Brain, debatably the first video game, is displayed to the public at the Canadian National Exhibition."},{"start_year":1950,"end_year":1950,"description":"The Toroidal chamber with axial magnetic fields (the Tokamak) is developed by Igor E. Tamm and Andrei D. Sakharov."},{"start_year":1952,"end_year":1952,"description":"The float glass process is developed by Alastair Pilkington."},{"start_year":1952,"end_year":1952,"description":"The first thermonuclear weapon is developed."},{"start_year":1953,"end_year":1953,"description":"The first video tape recorder, a helical scan recorder, is invented by Norikazu Sawazaki."},{"start_year":1954,"end_year":1954,"description":"Invention of the solar battery by Bell Telephone scientists, Calvin Souther Fuller, Daryl Chapin and Gerald Pearson capturing the Sun's power. First practical means of collecting energy from the Sun and turning it into a current of electricity."},{"start_year":1955,"end_year":1955,"description":"The hovercraft is patented by Christopher Cockerell."},{"start_year":1955,"end_year":1955,"description":": Jonas Salk received the license for his inactivated polio vaccine"},{"start_year":1955,"end_year":1955,"description":"The intermodal container is developed by Malcom McLean."},{"start_year":1956,"end_year":1956,"description":"The hard disk drive is invented by IBM."},{"start_year":1956,"end_year":1956,"description":"The Logic Theorist computer program, the first \"artificial intelligence program\", was written and invented by Allen Newell, Herbert A. Simon, and Cliff Shaw."},{"start_year":1957,"end_year":1957,"description":"The laser and optical amplifier are invented and named by Gordon Gould and Charles Townes. The laser and optical amplifier are foundational to powering the Internet."},{"start_year":1957,"end_year":1957,"description":"The first personal computer used by one person and controlled by a keyboard, the IBM 610, is invented by IBM."},{"start_year":1957,"end_year":1957,"description":"The first artificial satellite, Sputnik 1, is launched."},{"start_year":1959,"end_year":1959,"description":"The MOSFET (MOS transistor) is invented by the Egyptian Mohamed Atalla and the Korean Dawon Kahng at Bell Labs. It is used in almost all modern electronic products. It was smaller, faster, more reliable and cheaper to manufacture than earlier bipolar transistors, leading to a revolution in computers, controls and communication."},{"start_year":1960,"end_year":1960,"description":"The first functioning laser is invented by Theodore Maiman."},{"start_year":1960,"end_year":1960,"description":"First robotic exoskeleton"},{"start_year":1963,"end_year":1963,"description":"The first electronic cigarette is created by Herbert A. Gilbert. Hon Lik is often credited with its invention as he developed the modern electronic cigarette and was the first to commercialize it."},{"start_year":1964,"end_year":1964,"description":"Shinkansen, the first high-speed rail commercial passenger service."},{"start_year":1965,"end_year":1965,"description":"Kevlar is invented by Stephanie Kwolek at DuPont."},{"start_year":1967,"end_year":1967,"description":"E. A. Johnson of the Royal Radar Establishment developed the capacitive touch display or touchscreen"},{"start_year":1969,"end_year":1969,"description":"The NPL network followed by the ARPANET implement packet switching for data communication,"},{"start_year":1970,"end_year":1970,"description":"The pocket calculator is invented."},{"start_year":1971,"end_year":1971,"description":"The first single-chip microprocessor, the Intel 4004, is invented. Its development was led by Federico Faggin, using his silicon-gate MOS technology. This led to the personal computer (PC) revolution."},{"start_year":1971,"end_year":1971,"description":"The first space station, Salyut 1, is launched."},{"start_year":1971,"end_year":1971,"description":"IBM developed and released the world's first floppy disk and disk drive."},{"start_year":1972,"end_year":1972,"description":"The first video game console, used primarily for playing video games on a TV, is the Magnavox Odyssey."},{"start_year":1972,"end_year":1972,"description":": Herbert Boyer and Stanley Cohen developed genetic modification when they successfully modified DNA"},{"start_year":1973,"end_year":1973,"description":"The first fiber optic communication systems were developed by Optelecom."},{"start_year":1973,"end_year":1973,"description":"The first commercial graphical user interface is introduced in 1973 on the Xerox Alto. The modern GUI is later popularized by the Xerox Star and Apple Lisa."},{"start_year":1973,"end_year":1973,"description":"The first capacitive touchscreen is developed at CERN."},{"start_year":1974,"end_year":1974,"description":"The Transmission Control Program is proposed by Vinton Cerf and Robert E. Kahn, building on the work of Louis Pouzin and other Internet pioneers, creating the basis for the modern Internet."},{"start_year":1974,"end_year":1974,"description":"The lithium-ion battery is invented by M. Stanley Whittingham, and further developed in the 1980s and 1990s by John B. Goodenough, Rachid Yazami and Akira Yoshino. It has impacted modern consumer electronics and electric vehicles."},{"start_year":1974,"end_year":1974,"description":"The Rubik's cube is invented by Ernő Rubik which went on to be the best selling puzzle ever."},{"start_year":1975,"end_year":1975,"description":"First general purpose home automation network technology, X10, was developed"},{"start_year":1977,"end_year":1977,"description":"Dr Walter Gilbert and Frederick Sanger invented a new DNA sequencing method for which they won the Nobel Prize."},{"start_year":1977,"end_year":1977,"description":"The first self-driving car that did not rely upon rails or wires under the road is designed by the Tsukuba Mechanical Engineering Laboratory."},{"start_year":1978,"end_year":1978,"description":"The Global Positioning System (GPS) enters service. While not the first Satellite navigation system, it is the first to enter widespread civilian use"},{"start_year":978,"end_year":978,"description":"1 Birth of the first child through in vitro fertilization (IVF), based on the research of  Patrick Steptoe and Robert Edwards"},{"start_year":1979,"end_year":1979,"description":"The first handheld game console with interchangeable game cartridges, the Microvision is released."},{"start_year":1979,"end_year":1979,"description":"Nippon Telegraph and Telephone (NTT) launched the first cellular network in Japan."},{"start_year":1979,"end_year":1979,"description":"Public dialup information, messaging and e-commerce services, were pioneered through CompuServe and RadioShack's MicroNET, and the UK's Post Office Telecommunications Prestel services."},{"start_year":1980,"end_year":1980,"description":"Flash memory (both NOR and NAND types) was invented by Fujio Masuoka while working for Toshiba. It was introduced to the public in 1984."},{"start_year":1980,"end_year":1980,"description":"Scientists Mark Skolnick, Ron Davis, Ray White, and David Botstein published their findings on a gene mapping tool using Restriction Fragment-length Polymorphisms (RFLP), that would have applications to identify heritable disorders, including some forms of cancer."},{"start_year":1981,"end_year":1981,"description":"The first reusable spacecraft, the Space Shuttle undergoes test flights ahead of full operation in 1982"},{"start_year":1981,"end_year":1981,"description":"Kane Kramer develops the credit card-sized, IXI digital media player."},{"start_year":1981,"end_year":1981,"description":"Televerket, a Swedish state-owned corporation, launched the Nordic Mobile Telephone (NMT) system."},{"start_year":1981,"end_year":1981,"description":"Comvik, a Swedish telecommunications company, launched the first commercial automatic cellular system. However, according to the Swedish Post and Telecom Authority, the company launched an unlicensed automatic system. Comvik didn't receive a license to operate until December 1981, two months after the NMT system was launched."},{"start_year":1982,"end_year":1982,"description":"A CD-ROM contains data accessible to, but not writable by, a computer for data storage and music playback. The 1985 Yellow Book standard developed by Sony and Philips adapted the format to hold any form of binary data."},{"start_year":1982,"end_year":1982,"description":"Direct to home satellite television transmission, with the launch of Sky One service."},{"start_year":1982,"end_year":1982,"description":"The first laptop computer is launched, the 8/16-bit Epson HX-20."},{"start_year":1983,"end_year":1983,"description":"Stereolithography is invented by Chuck Hull."},{"start_year":1983,"end_year":1983,"description":"Ameritech, now known as AT&T, commercialized the Bell System (its cellular network) in Chicago, Ill."},{"start_year":1984,"end_year":1984,"description":"The first commercially available cell phone in the US, the DynaTAC 8000X, is created by Motorola."},{"start_year":1984,"end_year":1984,"description":"Chuck Hull patents the stereolithography (SLA) process, also known as 3D printing"},{"start_year":1984,"end_year":1984,"description":"DNA profiling is pioneered by Alec Jeffreys."},{"start_year":1986,"end_year":1986,"description":"Technophone, a British mobile phone company, created the first pocket-sized cell phone, the Excell PCT105."},{"start_year":1989,"end_year":1989,"description":"Karlheinz Brandenburg would publish the audio compression algorithms that would be standardised as the: MPEG-1, layer 3 (mp3), and later the MPEG-2, layer 7 Advanced Audio Compression (AAC)."},{"start_year":1989,"end_year":1989,"description":"The World Wide Web is invented by computer scientist Tim Berners-Lee."},{"start_year":1990,"end_year":1990,"description":"The first search engine, \"Archie\", was created by Alan Emtage, Bill Heelan, and Peter J. Deutsch at McGill University"},{"start_year":1991,"end_year":1991,"description":"The first commercial flash-based solid-state drive is launched by SunDisk."},{"start_year":1991,"end_year":1991,"description":"The first sim card is developed by Munich smart-card maker Giesecke & Devrient"},{"start_year":1994,"end_year":1994,"description":"IBM Simon, the world's first smartphone, is developed by IBM. It had a touchscreen and the first built-in apps for a mobile device."},{"start_year":1994,"end_year":1994,"description":"First generation of Bluetooth is developed by Ericsson Mobile. A form of data communication on short distances between electronic devices"},{"start_year":1994,"end_year":1994,"description":"A Tetris variant on the Hagenuk MT-2000 device becomes the first mobile game"},{"start_year":1995,"end_year":1995,"description":"DVD is an optical disc storage format, invented and developed by Philips, Sony, Toshiba, and Panasonic. DVDs offer higher storage capacity than compact discs while having the same dimensions."},{"start_year":1996,"end_year":1996,"description":"The Ciena Corporation, in partnership with Sprint, deployed the first commercial dense wavelength-division multiplexing system, which created the massive capacity of the Internet."},{"start_year":1996,"end_year":1996,"description":"Mobile web was first commercially offered in Finland on the Nokia 9000 Communicator phone, and it was also the first phone with texting"},{"start_year":1996,"end_year":1996,"description":"Bolt and Six Degrees (1997) both become the first social media sites."},{"start_year":1996,"end_year":1996,"description":"Myriad Genetics released the BRACAnalysis, the first commercial genetic test for assessing the risk of hereditary breast and ovarian cancer."},{"start_year":1998,"end_year":1998,"description":"The search engine Google, is launched."},{"start_year":1999,"end_year":1999,"description":"The first capsule endoscopy was performed, after being invented in the mid-1990s by Gavriel Iddan"},{"start_year":1999,"end_year":1999,"description":"The first digital video recorder (DVR), the TiVo, is launched"},{"start_year":1999,"end_year":1999,"description":"NTT DoCoMo launches i-mode, the first integrated Online App store for mobile phones"},{"start_year":2001,"end_year":2001,"description":"The Food and Drug Administration approved the first contraceptive patch"},{"start_year":2003,"end_year":2003,"description":"Development of the Android operating system for mobile devices"},{"start_year":2004,"end_year":2004,"description":"First podcast, invented by Adam Curry and Dave Wine"},{"start_year":2005,"end_year":2005,"description":"YouTube, the first popular video-streaming site, was founded by Jawed Karim"},{"start_year":2006,"end_year":2006,"description":"Amazon pioneered cloud computing"},{"start_year":2007,"end_year":2007,"description":"Apple Inc. released the iPhone"},{"start_year":2007,"end_year":2007,"description":"First Kindle e-reader introduced by Amazon"},{"start_year":2007,"end_year":2007,"description":"Subscription video on demand first offered by Netflix and Hulu"},{"start_year":2008,"end_year":2008,"description":"Satoshi Nakamoto develops the first blockchain."},{"start_year":2009,"end_year":2009,"description":"The first quantum machine was created by Aaron D. O'Connell"},{"start_year":2010,"end_year":2010,"description":"The first synthetic organism, Mycoplasma laboratorium is created by the J. Craig Venter Institute"},{"start_year":2010,"end_year":2010,"description":"Solid-state Lidar technology was introduced, replacing mechanical scanning with electronic beam steering"},{"start_year":2011,"end_year":2011,"description":"Apple released Siri, the first major company's virtual assistant"},{"start_year":2014,"end_year":2014,"description":"Introduction of Pepper, the first commercial  humanoid robot"},{"start_year":2014,"end_year":2014,"description":"Introduction of the Amazon Echo alongside Amazon Alexa, introducing smart home technology to homes"},{"start_year":2015,"end_year":2015,"description":"Discovery of CRISPR gene editing method"},{"start_year":2016,"end_year":2016,"description":"First commercially available artificial pancreas"},{"start_year":2016,"end_year":2016,"description":": First successful launch of a multi-use rocket by SpaceX"},{"start_year":2019,"end_year":2019,"description":"IBM launches IBM Q System One, its first integrated quantum computing system for commercial use."},{"start_year":2019,"end_year":2019,"description":"5G broadband cellular network technology introduced"},{"start_year":2020,"end_year":2020,"description":"The first MRNA vaccine to be approved by public health medicines regulators is co-developed by Pfizer and BioNTech for COVID-19, with the potential to treat other diseases and cancer"},{"start_year":2020,"end_year":2020,"description":"OpenAI demonstrated an Artificial Intelligence model called GPT-3. The program was created to generate human-like responses when given prompts."},{"start_year":2022,"end_year":2022,"description":"ChatGPT is launched to the public, making it the first mainstream generative AI to be released"}]